In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Data.xlsx",sheet_name='Day 2')

In [3]:
df

   vehicle_id electric airbag
0           1        Y      N
1           2        N      Y
2           3        Y      Y
3           4        N      N
4           5        Y      Y

In [4]:
df = df[(df['electric']=='Y') & (df['airbag']=='Y')][['vehicle_id']]

In [5]:
df

   vehicle_id
2           3
4           5

In [6]:
df1 = pd.read_excel("Data.xlsx",sheet_name='Day 3 emp')

In [7]:
df2 = pd.read_excel("Data.xlsx",sheet_name='Day 3 task')

In [8]:
df1

   emp_id emp_name
0       1    Alice
1       2      Bob
2       3    Carol
3       4    David

In [9]:
df2

   task_id  employee_id
0        1            3
1        2            1

In [11]:
merged_df = pd.merge(df1,df2,left_on='emp_id',right_on='employee_id',how='left')

In [12]:
merged_df

   emp_id emp_name  task_id  employee_id
0       1    Alice      2.0          1.0
1       2      Bob      NaN          NaN
2       3    Carol      1.0          3.0
3       4    David      NaN          NaN

In [13]:
unassigned_employees = merged_df[merged_df['task_id'].isnull()]

In [14]:
unassigned_employees

   emp_id emp_name  task_id  employee_id
1       2      Bob      NaN          NaN
3       4    David      NaN          NaN

In [15]:
result_df = unassigned_employees[['emp_name']]

In [16]:
result_df

  emp_name
1      Bob
3    David

In [17]:
result_df.columns = ['Employees']

In [18]:
result_df

  Employees
1       Bob
3     David

In [19]:
result_df.reset_index(drop=True, inplace=True)

In [20]:
result_df

  Employees
0       Bob
1     David